xuhaojie/STM8TL5x_StdPeriph_Lib/Libraries/STM8TL5x_StdPeriph_Driver/src/stm8tl5x_tim3.c
  /* Set or Reset the CC2P Bit */
  if (TIM3_OCPolarity == TIM3_OCPolarity_Low)
  {
    TIM3->CCER1 |= TIM_CCER1_CC2P ;
  }
  else
  {
    TIM3->CCER1 &= (uint8_t)(~TIM_CCER1_CC2P) ;
  }
}

/**
  * @brief Enables or disables the TIM3 Capture Compare Channel x.
  * @param[in] TIM3_Channel Specifies the TIM3 Channel.
  * @param[in] NewState     Specifies the TIM3 Channel CCxE bit new state.
  * @retval None
  */
void TIM3_CCxCmd(TIM3_Channel_TypeDef TIM3_Channel,
                 FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TIM3_CHANNEL(TIM3_Channel));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (TIM3_Channel == TIM3_Channel_1)
  {
    /* Set or Reset the CC1E Bit */
    if (NewState != DISABLE)
    {
      TIM3->CCER1 |= TIM_CCER1_CC1E ;
    }
    else
    {
      TIM3->CCER1 &= (uint8_t)(~TIM_CCER1_CC1E) ;
    }

  }
  else /* if (TIM3_Channel == TIM3_Channel_2) */
  {
    /* Set or Reset the CC2E Bit */
    if (NewState != DISABLE)
    {
      TIM3->CCER1 |= TIM_CCER1_CC2E;
    }
    else
    {
      TIM3->CCER1 &= (uint8_t)(~TIM_CCER1_CC2E) ;
    }
  }

}

/**
  * @brief Selects the TIM3 Ouput Compare Mode.
  * @param[in] TIM3_Channel Specifies the TIM3 Channel.
  * @param[in] TIM3_OCMode Specifies the TIM3 Output Compare Mode.
  * @retval None
  * @note
  * - This function disables the selected channel before changing the Ouput Compare Mode.
  * - User has to enable this channel using TIM3_CCxCmd and TIM3_CCxNCmd functions.
  */
void TIM3_SelectOCxM(TIM3_Channel_TypeDef TIM3_Channel,
                     TIM3_OCMode_TypeDef TIM3_OCMode)
{
  /* Check the parameters */
  assert_param(IS_TIM3_CHANNEL(TIM3_Channel));
  assert_param(IS_TIM3_OCM(TIM3_OCMode));

  if (TIM3_Channel == TIM3_Channel_1)
  {
    /* Disable the Channel 1: Reset the CCE Bit */
    TIM3->CCER1 &= (uint8_t)(~TIM_CCER1_CC1E);

    /* Reset the Output Compare Bits */
    TIM3->CCMR1 &= (uint8_t)(~TIM_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    TIM3->CCMR1 |= (uint8_t)TIM3_OCMode;
  }
  else /* if (TIM3_Channel == TIM3_Channel_2) */
  {
    /* Disable the Channel 2: Reset the CCE Bit */
    TIM3->CCER1 &= (uint8_t)(~TIM_CCER1_CC2E);

    /* Reset the Output Compare Bits */
    TIM3->CCMR2 &= (uint8_t)(~TIM_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    TIM3->CCMR2 |= (uint8_t)TIM3_OCMode;
  }
}

/**
  * @brief Sets the TIM3 Counter Register value.
  * @param[in] TIM3_Counter Specifies the Counter register new value (must be between 0x0000 and 0xFFFF).
  * @retval None
  */
void TIM3_SetCounter(uint16_t TIM3_Counter)
{

  /* Set the Counter Register value */
  TIM3->CNTRH = (uint8_t)(TIM3_Counter >> 8);
  TIM3->CNTRL = (uint8_t)(TIM3_Counter);
}

/**
  * @brief Sets the TIM3 Autoreload Register value.
  * @param[in] TIM3_Autoreload Specifies the Autoreload register new value (must be between 0x0000 and 0xFFFF).
  * @retval None
  */
void TIM3_SetAutoreload(uint16_t TIM3_Autoreload)
{
  /* Set the Autoreload Register value */
  TIM3->ARRH = (uint8_t)(TIM3_Autoreload >> 8);
  TIM3->ARRL = (uint8_t)(TIM3_Autoreload);
}

/**
  * @brief Sets the TIM3 Capture Compare1 Register value.
  * @param[in] TIM3_Compare Specifies the Capture Compare1 register new value (must be between 0x0000 and 0xFFFF).
  * @retval None
  */
void TIM3_SetCompare1(uint16_t TIM3_Compare)
{
  /* Set the Capture Compare1 Register value */
  TIM3->CCR1H = (uint8_t)(TIM3_Compare >> 8);
  TIM3->CCR1L = (uint8_t)(TIM3_Compare);
}

/**
  * @brief Sets the TIM3 Capture Compare2 Register value.
  * @param[in] TIM3_Compare Specifies the Capture Compare2 register new value (must be between 0x0000 and 0xFFFF).
  * @retval None
  */
void TIM3_SetCompare2(uint16_t TIM3_Compare)
{
  /* Set the Capture Compare2 Register value */
  TIM3->CCR2H = (uint8_t)(TIM3_Compare >> 8);
  TIM3->CCR2L = (uint8_t)(TIM3_Compare);
}

/**
  * @brief Sets the TIM3 Input Capture 1 prescaler.
  * @param[in] TIM3_IC1Prescaler Specifies the Input Capture prescaler new value
  * @retval None
  */
void TIM3_SetIC1Prescaler(TIM3_ICPSC_TypeDef TIM3_IC1Prescaler)
{
  uint8_t tmpccmr1 = 0;

  /* Check the parameters */
  assert_param(IS_TIM3_IC_PRESCALER(TIM3_IC1Prescaler));

  tmpccmr1 = TIM3->CCMR1;

  /* Reset the IC1PSC Bits */
  tmpccmr1 &= (uint8_t)(~TIM_CCMR_ICxPSC);

  /* Set the IC1PSC value */
  tmpccmr1 |= (uint8_t)TIM3_IC1Prescaler;

  TIM3->CCMR1 = tmpccmr1;
}

/**
  * @brief Sets the TIM3 Input Capture 2 prescaler.
  * @param[in] TIM3_IC2Prescaler Specifies the Input Capture prescaler new value
  * @retval None
  */
void TIM3_SetIC2Prescaler(TIM3_ICPSC_TypeDef TIM3_IC2Prescaler)
{
  uint8_t tmpccmr2 = 0;

  /* Check the parameters */
  assert_param(IS_TIM3_IC_PRESCALER(TIM3_IC2Prescaler));

  tmpccmr2 = TIM3->CCMR2;

  /* Reset the IC2PSC Bits */
  tmpccmr2 &= (uint8_t)(~TIM_CCMR_ICxPSC);

  /* Set the IC2PSC value */
  tmpccmr2 |= (uint8_t)TIM3_IC2Prescaler;

  TIM3->CCMR2 = tmpccmr2;
}

/**
  * @brief Gets the TIM3 Input Capture 1 value.
  * @param None
  * @retval uint16_t Capture Compare 1 Register value.
  */
uint16_t TIM3_GetCapture1(void)
{
  uint16_t tmpccr1 = 0;
  uint8_t tmpccr1l, tmpccr1h;

  tmpccr1h = TIM3->CCR1H;
  tmpccr1l = TIM3->CCR1L;

  tmpccr1 = (uint16_t)(tmpccr1l);
  tmpccr1 |= (uint16_t)((uint16_t)tmpccr1h << 8);
  /* Get the Capture 1 Register value */
  return ((uint16_t)tmpccr1);
}

/**
  * @brief Gets the TIM3 Input Capture 2 value.
  * @param None
  * @retval uint16_t Capture Compare 2 Register value.
  */
uint16_t TIM3_GetCapture2(void)
{
  uint16_t tmpccr2 = 0;
  uint8_t tmpccr2l, tmpccr2h;

  tmpccr2h = TIM3->CCR2H;
  tmpccr2l = TIM3->CCR2L;

  tmpccr2 = (uint16_t)(tmpccr2l);
  tmpccr2 |= (uint16_t)((uint16_t)tmpccr2h << 8);
  /* Get the Capture 2 Register value */
  return ((uint16_t)tmpccr2);
}

/**
  * @brief Gets the TIM3 Counter value.
  * @param None
  * @retval uint16_t Counter Register value.
  */
uint16_t TIM3_GetCounter(void)
{
  uint16_t tmpcnt = 0;
  uint8_t tmpcntrl, tmpcntrh;

  tmpcntrh = TIM3->CNTRH;
  tmpcntrl = TIM3->CNTRL;

